---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures
source: html/04ab9a82-f651-c83c-6ec1-f8ef2b8c14f6.htm
---
# BuiltInFailures.OverlapFailures Properties

Highlighted area boundary lines overlap. Color fills, area tags, and areas may not behave correctly.